{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling3", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution4_weight", 
      "attr": {
        "kernel": "(2, 2)", 
        "num_filter": "64"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution4_bias", 
      "attr": {
        "kernel": "(2, 2)", 
        "num_filter": "64"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attr": {
        "kernel": "(2, 2)", 
        "num_filter": "64"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation6", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling4", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution5_weight", 
      "attr": {
        "kernel": "(2, 2)", 
        "num_filter": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution5_bias", 
      "attr": {
        "kernel": "(2, 2)", 
        "num_filter": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attr": {
        "kernel": "(2, 2)", 
        "num_filter": "128"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation7", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling5", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten1", 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected3_weight", 
      "attr": {"num_hidden": "500"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected3_bias", 
      "attr": {"num_hidden": "500"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected3", 
      "attr": {"num_hidden": "500"}, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected4_weight", 
      "attr": {"num_hidden": "500"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected4_bias", 
      "attr": {"num_hidden": "500"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected4", 
      "attr": {"num_hidden": "500"}, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation9", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected5_weight", 
      "attr": {"num_hidden": "30"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected5_bias", 
      "attr": {"num_hidden": "30"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected5", 
      "attr": {"num_hidden": "30"}, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "LinearRegressionOutput", 
      "name": "linearregressionoutput1", 
      "inputs": [[27, 0, 0], [28, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    6, 
    7, 
    11, 
    12, 
    17, 
    18, 
    21, 
    22, 
    25, 
    26, 
    28
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30
  ], 
  "heads": [[29, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 905]}
}