{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution6_weight", 
      "attr": {
        "kernel": "(8, 6)", 
        "num_filter": "20"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution6_bias", 
      "attr": {
        "kernel": "(8, 6)", 
        "num_filter": "20"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution6", 
      "attr": {
        "kernel": "(8, 6)", 
        "num_filter": "20"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation10", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling6", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution7_weight", 
      "attr": {
        "kernel": "(6, 4)", 
        "num_filter": "64"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution7_bias", 
      "attr": {
        "kernel": "(6, 4)", 
        "num_filter": "64"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution7", 
      "attr": {
        "kernel": "(6, 4)", 
        "num_filter": "64"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation11", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling7", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution8_weight", 
      "attr": {
        "kernel": "(4, 3)", 
        "num_filter": "90"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution8_bias", 
      "attr": {
        "kernel": "(4, 3)", 
        "num_filter": "90"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution8", 
      "attr": {
        "kernel": "(4, 3)", 
        "num_filter": "90"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation12", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling8", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten2", 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected6_weight", 
      "attr": {"num_hidden": "500"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected6_bias", 
      "attr": {"num_hidden": "500"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected6", 
      "attr": {"num_hidden": "500"}, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation13", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected7_weight", 
      "attr": {"num_hidden": "200"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected7_bias", 
      "attr": {"num_hidden": "200"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected7", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation14", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected8_weight", 
      "attr": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected8_bias", 
      "attr": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected8", 
      "attr": {"num_hidden": "10"}, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[27, 0, 0], [28, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    6, 
    7, 
    11, 
    12, 
    17, 
    18, 
    21, 
    22, 
    25, 
    26, 
    28
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30
  ], 
  "heads": [[29, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 905]}
}